<a href="https://colab.research.google.com/github/pradeepetech/testproject/blob/master/PHDEDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
a = []
while(1):
    a.append('1')

In [0]:
# Importing required libraries.
import pandas as pd
import numpy as np
import seaborn as sns #visualisation
import matplotlib.pyplot as plt #visualisation
%matplotlib inline 
sns.set(color_codes=True)
import os

In [2]:
os.getcwd()

'/content'

In [3]:
# Loading Data in pandas Dataframe
df1 = pd.read_csv("/content/drive/My Drive/traindata.csv")
# Dataset is now stored in a Pandas Dataframe

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
# To display the top 5 rows
df1.head(5)

         date   locationId      item_id  unit_sales onpromotion
0  2015-01-01  location_25  item_103665         7.0         NaN
1  2015-01-01  location_25  item_105574         1.0         NaN
2  2015-01-01  location_25  item_105575         2.0         NaN
3  2015-01-01  location_25  item_108079         1.0         NaN
4  2015-01-01  location_25  item_108701         1.0         NaN

In [5]:
# Checking the data type
df1.dtypes

date            object
locationId      object
item_id         object
unit_sales     float64
onpromotion     object
dtype: object

In [6]:
# Total number of rows and columns
df1.shape

(101688779, 5)

In [7]:
print(df1.isnull().sum())

date                  0
locationId            0
item_id               0
unit_sales            0
onpromotion    21657651
dtype: int64

In [0]:
# Type Conversations
df1['date'] = df1['date'].astype('datetime64')

In [0]:
#Catogarical Data
catdata = ['locationId','item_id','onpromotion']

In [0]:
numdata = ['unit_sales']

In [0]:
for num in numdata:
  df1[num] = df1[num].astype('int32')

In [0]:
for cat in catdata:
  df1[cat] = df1[cat].astype('category')

In [13]:
# Checking the data type
df1.dtypes

date           datetime64[ns]
locationId           category
item_id              category
unit_sales              int32
onpromotion          category
dtype: object

In [0]:
df1["onpromotion"].fillna(0, inplace=True)

In [15]:
print(df1.isnull().sum())

date           0
locationId     0
item_id        0
unit_sales     0
onpromotion    0
dtype: int64

In [16]:
df1['onpromotion'].value_counts()

False    96627806
True      5060973
Name: onpromotion, dtype: int64

In [0]:
df1['onpromotion'] = df1['onpromotion'].replace(np.NaN, 'Unknown')

In [0]:
df2 = pd.read_csv("/content/drive/My Drive/item_details.csv")

In [28]:
df2.head()

       item_id           category_of_item       class  perishable
0   item_96995              grocery_items  class_1093           0
1   item_99197              grocery_items  class_1067           0
2  item_103501         cleaning_utilities  class_3008           0
3  item_103520              grocery_items  class_1028           0
4  item_103665  baked_items / bread_based  class_2712           1

In [0]:
catdata = ['item_id','category_of_item','class']

In [0]:
numdata = ['perishable']

In [0]:
for num in numdata:
  df2[num] = df2[num].astype('int8')

In [0]:
for cat in catdata:
  df2[cat] = df2[cat].astype('category')

In [0]:
df1_df2 = pd.merge(df1,df2, on='item_id', how='left')

In [38]:
df1_df2.head()

       item_id         category_of_item_x  ...     class_y  perishable_y
0   item_96995              grocery_items  ...  class_1093             0
1   item_99197              grocery_items  ...  class_1067             0
2  item_103501         cleaning_utilities  ...  class_3008             0
3  item_103520              grocery_items  ...  class_1028             0
4  item_103665  baked_items / bread_based  ...  class_2712             1

[5 rows x 7 columns]

In [0]:
df3 = pd.read_csv("/content/drive/My Drive/location_details.csv")

In [40]:
df3.head()

  location_id       city      state type  cluster
0  location_1  Bengaluru  Karnataka    D       13
1  location_2  Bengaluru  Karnataka    D       13
2  location_3  Bengaluru  Karnataka    D        8
3  location_4  Bengaluru  Karnataka    D        9
4  location_5      Delhi        NCR    D        4

In [0]:
catdata = ['location_id','city','state','type']

In [0]:
numdata = ['cluster']

In [0]:
for num in numdata:
  df3[num] = df3[num].astype('int8')

In [0]:
for cat in catdata:
  df3[cat] = df3[cat].astype('category')

In [0]:
df4 = pd.read_csv("/content/drive/My Drive/train_transactions.csv")

In [46]:
df4.head()

         date location_identifier  transactions
0  2015-01-01         location_25           770
1  2015-01-02          location_1          2111
2  2015-01-02          location_2          2358
3  2015-01-02          location_3          3487
4  2015-01-02          location_4          1922

In [0]:
catdata = ['location_identifier']

In [0]:
numdata = ['transactions']

In [0]:
for num in numdata:
  df4[num] = df4[num].astype('int8')

In [0]:
for cat in catdata:
  df4[cat] = df4[cat].astype('category')